alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
/*
 * Register definitions for STM32F4xx.
 *
 * Copyright (C) 2013 Dmitry Podkhvatilin, <vatilin@gmail.com>
 *
 * This file is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * You can redistribute this file and/or modify it under the terms of the GNU
 * General Public License (GPL) as published by the Free Software Foundation;
 * either version 2 of the License, or (at your discretion) any later version.
 * See the accompanying file "COPYING.txt" for more details.
 *
 * As a special exception to the GPL, permission is granted for additional
 * uses of the text contained in this file.  See the accompanying file
 * "COPY-UOS.txt" for details.
 */
typedef volatile unsigned int arm_reg_t;


#define ARM_SRAM_BASE       0x20000000  // Internal static memory
#define ARM_PERIPH_BASE     0x40000000  // Peripheral registers
#define ARM_SYSTEM_BASE     0xE0000000  // Core registers

#define ARM_SRAM_SIZE       (192*1024)   // Internal SRAM size

#include <runtime/cortex-m/io-cortex-m.h>

//
// Peripheral memory map
//
#define STM_TIM2_BASE           0x40000000
#define STM_TIM3_BASE           0x40000400
#define STM_TIM4_BASE           0x40000800
#define STM_TIM6_BASE           0x40001000
#define STM_TIM7_BASE           0x40001400
#define STM_RTC_BKP_BASE        0x40002800
#define STM_WWDG_BASE           0x40002C00
#define STM_IWDG_BASE           0x40003000
#define STM_I2S2EXT_BASE        0x40003400
#define STM_SPI2_I2S2_BASE      0x40003800
#define STM_SPI3_I2S3_BASE      0x40003C00
#define STM_I2S3EXT_BASE        0x40004000
#define STM_USART2_BASE         0x40004400
#define STM_USART3_BASE         0x40004800
#define STM_UART4_BASE          0x40004C00
#define STM_UART5_BASE          0x40005000
#define STM_I2C1_BASE           0x40005400
#define STM_I2C2_BASE           0x40005800
#define STM_USB_DEV_BASE        0x40005C00
#define STM_USB_SRAM_BASE       0x40006000
#define STM_BXCAN_BASE          0x40006400
#define STM_PWR_BASE            0x40007000
#define STM_DAC1_BASE           0x40007400
#define STM_I2C3_BASE           0x40007800
#define STM_DAC2_BASE           0x40009800
#define STM_SYSCFG_BASE         0x40010000
#define STM_EXTI_BASE           0x40010400
#define STM_TIM1_BASE           0x40012C00
#define STM_SPI1_BASE           0x40013000
#define STM_TIM8_BASE           0x40013400
#define STM_USART1_BASE         0x40013800
#define STM_SPI4_BASE           0x40013C00
#define STM_TIM15_BASE          0x40014000
#define STM_TIM16_BASE          0x40014400
#define STM_TIM17_BASE          0x40014800
#define STM_TIM20_BASE          0x40015000
#define STM_DMA1_BASE           0x40020000
#define STM_DMA2_BASE           0x40020400
#define STM_RCC_BASE            0x40021000
#define STM_FLASH_BASE          0x40022000
#define STM_CRC_BASE            0x40023000
#define STM_TSC_BASE            0x40024000
#define STM_GPIOA_BASE          0x48000000
#define STM_GPIOB_BASE          0x48000400
#define STM_GPIOC_BASE          0x48000800
#define STM_GPIOD_BASE          0x48000C00
#define STM_GPIOE_BASE          0x48001000
#define STM_GPIOF_BASE          0x48001400
#define STM_GPIOG_BASE          0x48001800
#define STM_GPIOH_BASE          0x48001C00
#define STM_ADC1_ADC2_BASE      0x50000000
#define STM_ADC3_ADC4_BASE      0x50000400
#define STM_FMC_BANK1_2_BASE    0x60000000
#define STM_FMC_BANK3_4_BASE    0x80000400
#define STM_FMC_BASE            0xA0000400


typedef enum
{
    IRQ_WWDG,
    IRQ_PVD,
    IRQ_TAMPER_STAMP,
    IRQ_RTC_WKUP,
    IRQ_FLASH,
    IRQ_RCC,
    IRQ_EXTI0,
    IRQ_EXTI1,
    IRQ_EXTI2_TS,
    IRQ_EXTI3,
    IRQ_EXTI4,
    IRQ_DMA1_CHANNEL1,
    IRQ_DMA1_CHANNEL2,
    IRQ_DMA1_CHANNEL3,
    IRQ_DMA1_CHANNEL4,
    IRQ_DMA1_CHANNEL5,
    IRQ_DMA1_CHANNEL6,
    IRQ_DMA1_CHANNEL7,
    IRQ_ADC1_2,
    IRQ_USB_HP_CAN1_TX,
    IRQ_USB_LP_CAN1_RX0,
    IRQ_CAN1_RX1,
    IRQ_CAN1_SCE,
    IRQ_EXTI9_5,
    IRQ_TIM1_BRK_TIM15,
    IRQ_TIM1_UP_TIM16,
    IRQ_TIM1_TRG_COM_TIM17,
    IRQ_TIM1_CC,
    IRQ_TIM2,
    IRQ_TIM3,
    IRQ_TIM4,
    IRQ_I2C1_EV,
    IRQ_I2C1_ER,
    IRQ_I2C2_EV,
    IRQ_I2C2_ER,
    IRQ_SPI1,
    IRQ_SPI2,
    IRQ_USART1,
    IRQ_USART2,
    IRQ_USART3,
    IRQ_EXTI15_10,
    IRQ_RTC_ALARM,
    IRQ_USB_WKUP,
    IRQ_TIM8_BRK,
    IRQ_TIM8_UP,
    IRQ_TIM8_TRG_COM,
    IRQ_TIM8_CC,
    IRQ_ADC3,
    IRQ_FMC,
    IRQ_RESERVED0,
    IRQ_RESERVED1,
    IRQ_SPI3,
    IRQ_UART4,
    IRQ_UART5,
    IRQ_TIM6_DAC,
    IRQ_TIM7,
    IRQ_DMA2_CHANNEL1,
    IRQ_DMA2_CHANNEL2,
    IRQ_DMA2_CHANNEL3,
    IRQ_DMA2_CHANNEL4,
    IRQ_DMA2_CHANNEL5,
    IRQ_ADC4,
    IRQ_RESERVED2,
    IRQ_RESERVED3,
    IRQ_COMP1_2_3,
    IRQ_COMP4_5_6,
    IRQ_COMP7,
    IRQ_I2C3_EV,
    IRQ_I2C3_ER,
    IRQ_USB_HP,
    IRQ_USB_LP,
    IRQ_USB_WKUP_RMP,
    IRQ_TIM20_BRK,
    IRQ_TIM20_UP,
    IRQ_TIM20_TRG_COM,
    IRQ_TIM20_CC,
    IRQ_FPU,
    IRQ_RESERVED4,
    IRQ_RESERVED5,
    IRQ_SPI4,
    ARCH_TIMER_IRQ,
    ARCH_INTERRUPTS
} IRQn_t;


/////////////////////////////////////////
// Reset and clock control
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Clock control
    arm_reg_t CFGR;     // Clock configuration
    arm_reg_t CIR;      // Clock interrupt
    arm_reg_t AHB2RSTR; // AHB2 peripheral reset
    arm_reg_t AHB1RSTR; // AHB1 peripheral reset
    arm_reg_t AHBENR;   // AHB1 peripheral clock enable
    arm_reg_t APB2ENR;  // APB2 peripheral clock enable
    arm_reg_t APB1ENR;  // APB1 peripheral clock enable
    arm_reg_t BDCR;     // Backup domain control
    arm_reg_t CSR;      // Clock control & status
    arm_reg_t AHBRSTR;  // AHB peripheral reset
    arm_reg_t CFGR2;    // Clock configuration 2
    arm_reg_t CFGR3;    // Clock configuration 3
} RCC_t;

#define RCC     ((RCC_t *) STM_RCC_BASE)

// CR bits
#define RCC_PLLRDY              (1 << 25)
#define RCC_PLLON               (1 << 24)
#define RCC_CSSON               (1 << 19)
#define RCC_HSEBYP              (1 << 18)
#define RCC_HSERDY              (1 << 17)
#define RCC_HSEON               (1 << 16)
#define RCC_HSICAL(n)           ((n) << 8)
#define RCC_HSITRIM(n)          ((n) << 3)
#define RCC_HSIRDY              (1 << 1)
#define RCC_HSION               (1 << 0)

// CFGR bits
#define RCC_PLLNODIV            (1 << 31)
#define RCC_MCOPRE_DIV1         (0 << 28)
#define RCC_MCOPRE_DIV2         (1 << 28)
#define RCC_MCOPRE_DIV4         (2 << 28)
#define RCC_MCOPRE_DIV8         (3 << 28)
#define RCC_MCOPRE_DIV16        (4 << 28)
#define RCC_MCOPRE_DIV32        (5 << 28)
#define RCC_MCOPRE_DIV64        (6 << 28)
#define RCC_MCOPRE_DIV128       (7 << 28)
#define RCC_MCOF                (1 << 28)
#define RCC_MCO_DISABLED        (0 << 24)
#define RCC_MCO_LSI             (2 << 24)
#define RCC_MCO_LSE             (3 << 24)
#define RCC_MCO_SYSCLK          (4 << 24)
#define RCC_MCO_HSI             (5 << 24)
#define RCC_MCO_HSE             (6 << 24)
#define RCC_MCO_PLL             (7 << 24)
#define RCC_I2SSRC              (1 << 23)
#define RCC_USBPRE              (1 << 22)
#define RCC_PLLMUL(x)           (((x) - 2) << 18)
#define RCC_PLLXTPRE            (1 << 17)
#define RCC_PLLSRC_HSI_DIV2     (0 << 15)
#define RCC_PLLSRC_HSI          (1 << 15)
#define RCC_PLLSRC_HSE          (2 << 15)
#define RCC_PPRE2_NODIV         (0 << 11)
#define RCC_PPRE2_DIV2          (4 << 11)
#define RCC_PPRE2_DIV4          (5 << 11)
#define RCC_PPRE2_DIV8          (6 << 11)
#define RCC_PPRE2_DIV16         (7 << 11)
#define RCC_PPRE1_NODIV         (0 << 8)
#define RCC_PPRE1_DIV2          (4 << 8)
#define RCC_PPRE1_DIV4          (5 << 8)
#define RCC_PPRE1_DIV8          (6 << 8)
#define RCC_PPRE1_DIV16         (7 << 8)
#define RCC_HPRE_NODIV          (0x0 << 4)
#define RCC_HPRE_DIV2           (0x8 << 4)
#define RCC_HPRE_DIV4           (0x9 << 4)
#define RCC_HPRE_DIV8           (0xA << 4)
#define RCC_HPRE_DIV16          (0xB << 4)
#define RCC_HPRE_DIV64          (0xC << 4)
#define RCC_HPRE_DIV128         (0xD << 4)
#define RCC_HPRE_DIV256         (0xE << 4)
#define RCC_HPRE_DIV512         (0xF << 4)
#define RCC_SWS_HSI             (0 << 2)
#define RCC_SWS_HSE             (1 << 2)
#define RCC_SWS_PLL             (2 << 2)
#define RCC_SWS_MASK            (3 << 2)
#define RCC_SW_HSI              (0 << 0)
#define RCC_SW_HSE              (1 << 0)
#define RCC_SW_PLL              (2 << 0)
#define RCC_SW_MASK             (3 << 0)

