alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
// CIR bits
#define RCC_CSSC                (1 << 23)
#define RCC_PLLI2SSDRYC         (1 << 21)
#define RCC_PLLRDYC             (1 << 20)
#define RCC_HSERDYC             (1 << 19)
#define RCC_HSIRDYC             (1 << 18)
#define RCC_LSERDYC             (1 << 17)
#define RCC_LSIRDYC             (1 << 16)
#define RCC_PLLRDYIE            (1 << 12)
#define RCC_HSERDYIE            (1 << 11)
#define RCC_HSIRDYIE            (1 << 10)
#define RCC_LSERDYIE            (1 << 9)
#define RCC_LSIRDYIE            (1 << 8)
#define RCC_CSSF                (1 << 7)
#define RCC_PLLRDYF             (1 << 4)
#define RCC_HSERDYF             (1 << 3)
#define RCC_HSIRDYF             (1 << 2)
#define RCC_LSERDYF             (1 << 1)
#define RCC_LSIRDYF             (1 << 0)

// APB2RSTR bits
#define RCC_TIM20RST            (1 << 20)
#define RCC_TIM17RST            (1 << 18)
#define RCC_TIM16RST            (1 << 17)
#define RCC_TIM15RST            (1 << 16)
#define RCC_SPI4RST             (1 << 15)
#define RCC_USART1RST           (1 << 14)
#define RCC_TIM8RST             (1 << 13)
#define RCC_SPI1RST             (1 << 12)
#define RCC_TIM1RST             (1 << 11)
#define RCC_SYSCFGRST           (1 << 0)

// APB1RSTR bits
#define RCC_I2C3RST             (1 << 30)
#define RCC_DAC1RST             (1 << 29)
#define RCC_PWRRST              (1 << 28)
#define RCC_DAC2RST             (1 << 26)
#define RCC_CANRST              (1 << 25)
#define RCC_USBRST              (1 << 23)
#define RCC_I2C2RST             (1 << 22)
#define RCC_I2C1RST             (1 << 21)
#define RCC_UART5RST            (1 << 20)
#define RCC_UART4RST            (1 << 19)
#define RCC_USART3RST           (1 << 18)
#define RCC_USART2RST           (1 << 17)
#define RCC_SPI3RST             (1 << 15)
#define RCC_SPI2RST             (1 << 14)
#define RCC_WWDGRST             (1 << 11)
#define RCC_TIM7RST             (1 << 5)
#define RCC_TIM6RST             (1 << 4)
#define RCC_TIM4RST             (1 << 2)
#define RCC_TIM3RST             (1 << 1)
#define RCC_TIM2RST             (1 << 0)

// AHBENR bits
#define RCC_ADC34EN             (1 << 29)
#define RCC_ADC12EN             (1 << 28)
#define RCC_TSCEN               (1 << 24)
#define RCC_IOPGEN              (1 << 23)
#define RCC_IOPFEN              (1 << 22)
#define RCC_IOPEEN              (1 << 21)
#define RCC_IOPDEN              (1 << 20)
#define RCC_IOPCEN              (1 << 19)
#define RCC_IOPBEN              (1 << 18)
#define RCC_IOPAEN              (1 << 17)
#define RCC_IOPHEN              (1 << 16)
#define RCC_CRCEN               (1 << 6)
#define RCC_FMCEN               (1 << 5)
#define RCC_FLITFEN             (1 << 4)
#define RCC_SRAMEN              (1 << 2)
#define RCC_DMA2EN              (1 << 1)
#define RCC_DMA1EN              (1 << 0)

// APB2ENR bits
#define RCC_TIM20EN             (1 << 20)
#define RCC_TIM17EN             (1 << 18)
#define RCC_TIM16EN             (1 << 17)
#define RCC_TIM15EN             (1 << 16)
#define RCC_SPI4EN              (1 << 15)
#define RCC_USART1EN            (1 << 14)
#define RCC_TIM8EN              (1 << 13)
#define RCC_SPI1EN              (1 << 12)
#define RCC_TIM1EN              (1 << 11)
#define RCC_SYSCFGEN            (1 << 0)

// APB1ENR bits
#define RCC_I2C3EN              (1 << 30)
#define RCC_DAC1EN              (1 << 29)
#define RCC_PWREN               (1 << 28)
#define RCC_DAC2EN              (1 << 26)
#define RCC_CANEN               (1 << 25)
#define RCC_USBEN               (1 << 23)
#define RCC_I2C2EN              (1 << 22)
#define RCC_I2C1EN              (1 << 21)
#define RCC_UART5EN             (1 << 20)
#define RCC_UART4EN             (1 << 19)
#define RCC_USART3EN            (1 << 18)
#define RCC_USART2EN            (1 << 17)
#define RCC_SPI3EN              (1 << 15)
#define RCC_SPI2EN              (1 << 14)
#define RCC_WWDGEN              (1 << 11)
#define RCC_TIM7EN              (1 << 5)
#define RCC_TIM6EN              (1 << 4)
#define RCC_TIM4EN              (1 << 2)
#define RCC_TIM3EN              (1 << 1)
#define RCC_TIM2EN              (1 << 0)

// BDCR bits
#define RCC_BDRST               (1 << 16)
#define RCC_RTCEN               (1 << 15)
#define RCC_RTCSEL_NOCLK        (0 << 8)
#define RCC_RTCSEL_LSE          (1 << 8)
#define RCC_RTCSEL_LSI          (2 << 8)
#define RCC_RTCSEL_HSE          (3 << 8)
#define RCC_LSEDRV_LOWER        (0 << 3)
#define RCC_LSEDRV_MEDIUM_HIGH  (1 << 3)
#define RCC_LSEDRV_MEDIUM_LOW   (2 << 3)
#define RCC_LSEDRV_HIGHER       (3 << 3)
#define RCC_LSEBYP              (1 << 2)
#define RCC_LSERDY              (1 << 1)
#define RCC_LSEON               (1 << 0)

// CSR bits
#define RCC_LPWRRSTF            (1 << 31)
#define RCC_WWDGRSTF            (1 << 30)
#define RCC_IWDGRSTF            (1 << 29)
#define RCC_SFTRSTF             (1 << 28)
#define RCC_PORRSTF             (1 << 27)
#define RCC_PINRSTF             (1 << 26)
#define RCC_OBLRSTF             (1 << 25)
#define RCC_RMVF                (1 << 24)
#define RCC_V18PWRRSTF          (1 << 23)
#define RCC_LSIRDY              (1 << 1)
#define RCC_LSION               (1 << 0)

// AHBRSTR bits
#define RCC_ADC34RST            (1 << 29)
#define RCC_ADC12RST            (1 << 28)
#define RCC_TSCRST              (1 << 24)
#define RCC_IOPGRST             (1 << 23)
#define RCC_IOPFRST             (1 << 22)
#define RCC_IOPERST             (1 << 21)
#define RCC_IOPDRST             (1 << 20)
#define RCC_IOPCRST             (1 << 19)
#define RCC_IOPBRST             (1 << 18)
#define RCC_IOPARST             (1 << 17)
#define RCC_IOPHRST             (1 << 16)
#define RCC_FMCRST              (1 << 5)

// CFGR2 bits
#define RCC_ADC34PRES_DISABLE   (0x00 << 9)
#define RCC_ADC34PRES_DIV1      (0x10 << 9)
#define RCC_ADC34PRES_DIV2      (0x11 << 9)
#define RCC_ADC34PRES_DIV4      (0x12 << 9)
#define RCC_ADC34PRES_DIV6      (0x13 << 9)
#define RCC_ADC34PRES_DIV8      (0x14 << 9)
#define RCC_ADC34PRES_DIV10     (0x15 << 9)
#define RCC_ADC34PRES_DIV12     (0x16 << 9)
#define RCC_ADC34PRES_DIV16     (0x17 << 9)
#define RCC_ADC34PRES_DIV32     (0x18 << 9)
#define RCC_ADC34PRES_DIV64     (0x19 << 9)
#define RCC_ADC34PRES_DIV128    (0x1A << 9)
#define RCC_ADC34PRES_DIV256    (0x1B << 9)
#define RCC_ADC12PRES_DISABLE   (0x00 << 4)
#define RCC_ADC12PRES_DIV1      (0x10 << 4)
#define RCC_ADC12PRES_DIV2      (0x11 << 4)
#define RCC_ADC12PRES_DIV4      (0x12 << 4)
#define RCC_ADC12PRES_DIV6      (0x13 << 4)
#define RCC_ADC12PRES_DIV8      (0x14 << 4)
#define RCC_ADC12PRES_DIV10     (0x15 << 4)
#define RCC_ADC12PRES_DIV12     (0x16 << 4)
#define RCC_ADC12PRES_DIV16     (0x17 << 4)
#define RCC_ADC12PRES_DIV32     (0x18 << 4)
#define RCC_ADC12PRES_DIV64     (0x19 << 4)
#define RCC_ADC12PRES_DIV128    (0x1A << 4)
#define RCC_ADC12PRES_DIV256    (0x1B << 4)
#define RCC_PREDIV_DIV(n)       (((n) - 1))

