alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
// CFGR3 bits
#define RCC_TIM34SW_PCLK2       (0 << 25)
#define RCC_TIM34SW_PLLVCO      (1 << 25)
#define RCC_TIM2SW_PCLK2        (0 << 24)
#define RCC_TIM2SW_PLLVCO       (1 << 24)
#define RCC_UART5SW_PCLK        (0 << 22)
#define RCC_UART5SW_SYSCLK      (1 << 22)
#define RCC_UART5SW_LSE         (2 << 22)
#define RCC_UART5SW_HSI         (3 << 22)
#define RCC_UART4SW_PCLK        (0 << 20)
#define RCC_UART4SW_SYSCLK      (1 << 20)
#define RCC_UART4SW_LSE         (2 << 20)
#define RCC_UART4SW_HSI         (3 << 20)
#define RCC_UART3SW_PCLK        (0 << 18)
#define RCC_UART3SW_SYSCLK      (1 << 18)
#define RCC_UART3SW_LSE         (2 << 18)
#define RCC_UART3SW_HSI         (3 << 18)
#define RCC_UART2SW_PCLK        (0 << 16)
#define RCC_UART2SW_SYSCLK      (1 << 16)
#define RCC_UART2SW_LSE         (2 << 16)
#define RCC_UART2SW_HSI         (3 << 16)
#define RCC_TIM20SW_PCLK2       (0 << 15)
#define RCC_TIM20SW_PLLVCO      (1 << 15)
#define RCC_TIM17SW_PCLK2       (0 << 13)
#define RCC_TIM17SW_PLLVCO      (1 << 13)
#define RCC_TIM16SW_PCLK2       (0 << 11)
#define RCC_TIM16SW_PLLVCO      (1 << 11)
#define RCC_TIM15SW_PCLK2       (0 << 10)
#define RCC_TIM15SW_PLLVCO      (1 << 10)
#define RCC_TIM8SW_PCLK2        (0 << 9)
#define RCC_TIM8SW_PLLVCO       (1 << 9)
#define RCC_TIM1SW_PCLK2        (0 << 8)
#define RCC_TIM1SW_PLLVCO       (1 << 8)
#define RCC_I2C3SW_HSI          (0 << 6)
#define RCC_I2C3SW_SYSCLK       (1 << 6)
#define RCC_I2C2SW_HSI          (0 << 5)
#define RCC_I2C2SW_SYSCLK       (1 << 5)
#define RCC_I2C1SW_HSI          (0 << 4)
#define RCC_I2C1SW_SYSCLK       (1 << 4)
#define RCC_UART1SW_PCLK        (0 << 0)
#define RCC_UART1SW_SYSCLK      (1 << 0)
#define RCC_UART1SW_LSE         (2 << 0)
#define RCC_UART1SW_HSI         (3 << 0)


/////////////////////////////////////////
// Flash interface
/////////////////////////////////////////
typedef struct
{
    arm_reg_t ACR;
    arm_reg_t KEYR;
    arm_reg_t OPTKEYR;
    arm_reg_t SR;
    arm_reg_t CR;
    arm_reg_t AR;
    arm_reg_t OBR;
    arm_reg_t WRPR;
} FLASH_t;

#define FLASH     ((FLASH_t*) STM_FLASH_BASE)

// ACR bits
#define FLASH_PRFTBS            (1 << 5)
#define FLASH_PRFTBE            (1 << 4)
#define FLASH_HLFCYA            (1 << 3)
#define FLASH_LATENCY(n)        (n)

// KEYR bits
#define FLASH_KEY1              0x45670123
#define FLASH_KEY2              0xCDEF89AF

// OPTKEYR bits
#define FLASH_OPTKEY1           0x45670123
#define FLASH_OPTKEY2           0xCDEF89AF

// SR bits
#define FLASH_EOP               (1 << 5)
#define FLASH_WRPRTERR          (1 << 4)
#define FLASH_PGERR             (1 << 2)
#define FLASH_BSY               (1 << 0)

// CR bits
#define FLASH_OBL_LAUNCH        (1 << 13)
#define FLASH_EOPIE             (1 << 12)
#define FLASH_ERRIE             (1 << 10)
#define FLASH_OPTWRE            (1 << 9)
#define FLASH_LOCK              (1 << 7)
#define FLASH_STRT              (1 << 6)
#define FLASH_OPTER             (1 << 5)
#define FLASH_OPTPG             (1 << 4)
#define FLASH_MER               (1 << 2)
#define FLASH_PER               (1 << 1)
#define FLASH_PG                (1 << 0)

// OBR bits
#define FLASH_OBR_SRAM_PE           (1 << 14)
#define FLASH_OBR_SRAM_VDDA_MONITOR (1 << 13)
#define FLASH_OBR_NBOOT1            (1 << 12)
#define FLASH_OBR_NRST_STDBY        (1 << 10)
#define FLASH_OBR_NRST_STOP         (1 << 9)
#define FLASH_OBR_WDG_SW            (1 << 8)
#define FLASH_RDRPT(x)              ((x) << 1)
#define FLASH_OPTERR                (1 << 0)


/////////////////////////////////////////
// General purpose I/O
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MODER;    // Mode
    arm_reg_t OTYPER;   // Output type
    arm_reg_t OSPEEDR;  // Output speed
    arm_reg_t PUPDR;    // Pull-up/pull-down
    arm_reg_t IDR;      // Input data
    arm_reg_t ODR;      // Output data
    arm_reg_t BSRR;     // Bit set/reset
    arm_reg_t LCKR;     // Configuration lock
    arm_reg_t AFRL;     // Alternate function low register
    arm_reg_t AFRH;     // Alternate function high register
    arm_reg_t BRR;      // Bit reset
} GPIO_t;

#define GPIOA       ((GPIO_t*) STM_GPIOA_BASE)
#define GPIOB       ((GPIO_t*) STM_GPIOB_BASE)
#define GPIOC       ((GPIO_t*) STM_GPIOC_BASE)
#define GPIOD       ((GPIO_t*) STM_GPIOD_BASE)
#define GPIOE       ((GPIO_t*) STM_GPIOE_BASE)
#define GPIOF       ((GPIO_t*) STM_GPIOF_BASE)
#define GPIOG       ((GPIO_t*) STM_GPIOG_BASE)
#define GPIOH       ((GPIO_t*) STM_GPIOH_BASE)

// MODER bits
#define GPIO_IN(n)          (0 << (2 * n))  // Input mode
#define GPIO_OUT(n)         (1 << (2 * n))  // General purpose output mode
#define GPIO_ALT(n)         (2 << (2 * n))  // Alternate function mode
#define GPIO_ANA(n)         (3 << (2 * n))  // Analog mode
#define GPIO_MODE_MASK(n)   (3 << (2 * n))  // Mask

// OTYPER bits
#define GPIO_PP(n)      (0 << (n))      // Push-pull
#define GPIO_OD(n)      (1 << (n))      // Open drain

// OSPEEDR bits
#define GPIO_2MHz(n)        (0 << (2 * n))  // Low speed
#define GPIO_25MHz(n)       (1 << (2 * n))  // Medium speed
#define GPIO_50MHz(n)       (2 << (2 * n))  // Fast speed
#define GPIO_100MHz(n)      (3 << (2 * n))  // High speed
#define GPIO_OSPEED_MASK(n) (3 << (2 * n))  // Field mask

// PUPDR bits
#define GPIO_NO_PULL(n)   (0 << (2 * n))  // No pull-up, no pull-down
#define GPIO_PULL_UP(n)   (1 << (2 * n))  // Pull-up
#define GPIO_PULL_DOWN(n) (2 << (2 * n))  // Pull-down

// BSRR bits
#define GPIO_SET(n)     (1 << (n))      // Atomic set n-th bit of ODR
#define GPIO_RESET(n)   (1 << (n + 16)) // Atomic reset n-th bit of ODR

// LCKR bits
#define GPIO_LCK(n)     (1 << (n))      // Pin configuration lock
#define GPIO_LCKK(n)    (1 << 16)       // Port configuration lock key

#define GPIO_AF_MASK(n)     (0xF << (4 * ((n) & 7)))


/////////////////////////////////////////
// SYSCFG
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CFGR1;    // configuration 1
    arm_reg_t RCR;      // CCM SRAM protection
    arm_reg_t EXTICR1;  // external interrupt configuration 1
    arm_reg_t EXTICR2;  // external interrupt configuration 2
    arm_reg_t EXTICR3;  // external interrupt configuration 3
    arm_reg_t EXTICR4;  // external interrupt configuration 4
    arm_reg_t CFGR2;    // configuration 1
    arm_reg_t CFGR3;    // configuration 1
    arm_reg_t CFGR4;    // configuration 1
} SYSCFG_t;

