alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
#define SYSCFG      ((SYSCFG_t*) STM_SYSCFG_BASE)

// CFGR1 bits
#define SYSCFG_FPU_IE(x)                ((x) << 26)
#define SYSCFG_I2C3_FMP                 (1 << 24)
#define SYSCFG_ENCODER_MODE(x)          ((x) << 22)
#define SYSCFG_I2C2_FMP                 (1 << 21)
#define SYSCFG_I2C1_FMP                 (1 << 20)
#define SYSCFG_I2C_PBx_FMP(x)           ((x) << 16)
#define SYSCFG_DAC2_CH1_DMA_RMP         (1 << 15)
#define SYSCFG_TIM7_DAC1_CH2_DMA_RMP    (1 << 14)
#define SYSCFG_TIM6_DAC1_CH2_DMA_RMP    (1 << 13)
#define SYSCFG_TIM17_DMA_RMP            (1 << 12)
#define SYSCFG_TIM16_DMA_RMP            (1 << 11)
#define SYSCFG_ADC2_DMA_RMP             (1 << 8)
#define SYSCFG_DAC1_TRIG_RMP            (1 << 7)
#define SYSCFG_TIM1_ITR3_RMP            (1 << 6)
#define SYSCFG_USB_IT_RMP               (1 << 5)
#define SYSCFG_MEM_MODE(x)              (x)

// EXTICRx bits
#define SYSCFG_PA(x)                (0 << (((x) & 3) * 4))
#define SYSCFG_PB(x)                (1 << (((x) & 3) * 4))
#define SYSCFG_PC(x)                (2 << (((x) & 3) * 4))
#define SYSCFG_PD(x)                (3 << (((x) & 3) * 4))
#define SYSCFG_PE(x)                (4 << (((x) & 3) * 4))
#define SYSCFG_PH(x)                (5 << (((x) & 3) * 4))
#define SYSCFG_PF(x)                (6 << (((x) & 3) * 4))
#define SYSCFG_PG(x)                (7 << (((x) & 3) * 4))
#define SYSCFG_PMASK(x)             (0xF << (((x) & 3) * 4))

// CFGR2 bits
#define SYSCFG_SRAM_PEF             (1 << 8)
#define SYSCFG_BYP_ADDR_PAR         (1 << 4)
#define SYSCFG_PVD_LOCK             (1 << 2)
#define SYSCFG_SRAM_PARITY_LOCK     (1 << 1)
#define SYSCFG_LOCKUP_LOCK          (1 << 0)

// CFGR3 bits
#define SYSCFG_ADC2_DMA_RMP1        (1 << 9)
#define SYSCFG_ADC2_DMA_RMP0        (1 << 8)
#define SYSCFG_I2C1_TX_DMA_RMP(x)   ((x) << 6)
#define SYSCFG_I2C1_RX_DMA_RMP(x)   ((x) << 4)
#define SYSCFG_SPI1_TX_DMA_RMP(x)   ((x) << 2)
#define SYSCFG_SPI1_RX_DMA_RMP(x)   ((x) << 0)

// CFGR4 bits
#define SYSCFG_ADC34_JEXT14_RMP     (1 << 13)
#define SYSCFG_ADC34_JEXT11_RMP     (1 << 12)
#define SYSCFG_ADC34_JEXT5_RMP      (1 << 11)
#define SYSCFG_ADC34_EXT15_RMP      (1 << 10)
#define SYSCFG_ADC34_EXT6_RMP       (1 << 9)
#define SYSCFG_ADC34_EXT5_RMP       (1 << 8)
#define SYSCFG_ADC12_JEXT13_RMP     (1 << 7)
#define SYSCFG_ADC12_JEXT6_RMP      (1 << 6)
#define SYSCFG_ADC12_JEXT3_RMP      (1 << 5)
#define SYSCFG_ADC12_EXT15_RMP      (1 << 4)
#define SYSCFG_ADC12_EXT13_RMP      (1 << 3)
#define SYSCFG_ADC12_EXT5_RMP       (1 << 2)
#define SYSCFG_ADC12_EXT3_RMP       (1 << 1)
#define SYSCFG_ADC12_EXT2_RMP       (1 << 0)


/////////////////////////////////////////
// External interrupt/event controller
/////////////////////////////////////////
typedef struct
{
    arm_reg_t IMR1;     // Interrupt mask
    arm_reg_t EMR1;     // Event mask
    arm_reg_t RTSR1;    // Rising edge trigger selection
    arm_reg_t FTSR1;    // Falling edge trigger selection
    arm_reg_t SWIER1;   // Software interrupt event
    arm_reg_t PR1;      // Pending
    arm_reg_t IMR2;     // Interrupt mask
    arm_reg_t EMR2;     // Event mask
    arm_reg_t RTSR2;    // Rising edge trigger selection
    arm_reg_t FTSR2;    // Falling edge trigger selection
    arm_reg_t SWIER2;   // Software interrupt event
    arm_reg_t PR2;      // Pending
} EXTI_t;

#define EXTI     ((EXTI_t *) STM_EXTI_BASE)

// EXTI lines
#define EXTI_GPIO(n)        (1 << (n))
#define EXTI_PVD            (1 << 16)
#define EXTI_RTC_ALARM      (1 << 17)
#define EXTI_USB_DEV_FS     (1 << 18)
#define EXTI_RTC_TAMP_TS    (1 << 19)
#define EXTI_RTC_WKUP       (1 << 20)
#define EXTI_COMP1          (1 << 21)
#define EXTI_COMP2          (1 << 22)
#define EXTI_I2C1           (1 << 23)
#define EXTI_I2C2           (1 << 24)
#define EXTI_USART1         (1 << 25)
#define EXTI_USART2         (1 << 26)
#define EXTI_I2C3           (1 << 27)
#define EXTI_USART3         (1 << 28)
#define EXTI_COMP3          (1 << 29)
#define EXTI_COMP4          (1 << 30)
#define EXTI_COMP5          (1 << 31)
#define EXTI_COMP6          (1 << 0)    // Write to registers with index 2!
#define EXTI_COMP7          (1 << 1)    // Write to registers with index 2!
#define EXTI_UART4          (1 << 2)    // Write to registers with index 2!
#define EXTI_UART5          (1 << 3)    // Write to registers with index 2!


/////////////////////////////////////////
// USART
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR1;
    arm_reg_t CR2;
    arm_reg_t CR3;
    arm_reg_t BRR;
    arm_reg_t GTPR;
    arm_reg_t RTOR;
    arm_reg_t RQR;
    arm_reg_t ISR;
    arm_reg_t ICR;
    arm_reg_t RDR;
    arm_reg_t TDR;
} USART_t;

#define USART1   ((USART_t*) STM_USART1_BASE)
#define USART2   ((USART_t*) STM_USART2_BASE)
#define USART3   ((USART_t*) STM_USART3_BASE)
#define UART4    ((USART_t*) STM_UART4_BASE)
#define UART5    ((USART_t*) STM_UART5_BASE)

// CR1 bits
#define USART_M1            (1 << 28)
#define USART_EOBIE         (1 << 27)
#define USART_RTOIE         (1 << 26)
#define USART_DEAT(x)       ((x) << 21)
#define USART_DEDT(x)       ((x) << 16)
#define USART_OVER8         (1 << 15)
#define USART_CMIE          (1 << 14)
#define USART_MME           (1 << 13)
#define USART_M0            (1 << 12)
#define USART_WAKE          (1 << 11)
#define USART_PCE           (1 << 10)
#define USART_PS            (1 << 9)
#define USART_PEIE          (1 << 8)
#define USART_TXEIE         (1 << 7)
#define USART_TCIE          (1 << 6)
#define USART_RXNEIE        (1 << 5)
#define USART_IDLEIE        (1 << 4)
#define USART_TE            (1 << 3)
#define USART_RE            (1 << 2)
#define USART_UESM          (1 << 1)
#define USART_UE            (1 << 0)

// CR2 bits
#define USART_ADD(x)        ((x) << 24)
#define USART_RTOEN         (1 << 23)
#define USART_ABRMOD(x)     ((x) << 21)
#define USART_ABREN         (1 << 20)
#define USART_MSBFIRST      (1 << 19)
#define USART_DATAINV       (1 << 18)
#define USART_TXINV         (1 << 17)
#define USART_RXINV         (1 << 16)
#define USART_SWAP          (1 << 15)
#define USART_LINEN         (1 << 14)
#define USART_STOP_1        (0 << 12)
#define USART_STOP_05       (1 << 12)
#define USART_STOP_2        (2 << 12)
#define USART_STOP_15       (3 << 12)
#define USART_STOP_MASK     (3 << 12)
#define USART_CLKEN         (1 << 11)
#define USART_CPOL          (1 << 10)
#define USART_CPHA          (1 << 9)
#define USART_LBCL          (1 << 8)
#define USART_LBDIE         (1 << 6)
#define USART_LBDL          (1 << 5)
#define USART_ADDM7(x)      (x)

// CR3 bits
#define USART_WUFIE         (1 << 22)
#define USART_WUS_ADD_MATCH (0 << 20)
#define USART_WUS_START_BIT (2 << 20)
#define USART_WUS_RXNE      (3 << 20)
#define USART_SCARCNT(x)    ((x) << 17)
#define USART_DEP           (1 << 15)
#define USART_DEM           (1 << 14)
#define USART_DDRE          (1 << 13)
#define USART_OVRDIS        (1 << 12)
#define USART_ONEBIT        (1 << 11)
#define USART_CTSIE         (1 << 10)
#define USART_CTSE          (1 << 9)
#define USART_RTSE          (1 << 8)
#define USART_DMAT          (1 << 7)
#define USART_DMAR          (1 << 6)
#define USART_SCEN          (1 << 5)
#define USART_NACK          (1 << 4)
#define USART_HDSEL         (1 << 3)
#define USART_IRLP          (1 << 2)
#define USART_IREN          (1 << 1)
#define USART_EIE           (1 << 0)

// GTPR bits
#define USART_GT(n)         ((n) << 8)
#define USART_PSC(n)        (n)

