alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
// RTOR bits
#define USART_BLEN(x)       ((x) << 24)
#define USART_RTO(x)        (x)

// RQR bits
#define USART_TXFRQ         (1 << 4)
#define USART_RXFRQ         (1 << 3)
#define USART_MMRQ          (1 << 2)
#define USART_SBKRQ         (1 << 1)
#define USART_ABRRQ         (1 << 0)

// ISR bits
#define USART_REACK         (1 << 22)
#define USART_TEACK         (1 << 21)
#define USART_WUF           (1 << 20)
#define USART_RWU           (1 << 19)
#define USART_SBKF          (1 << 18)
#define USART_CMF           (1 << 17)
#define USART_BUSY          (1 << 16)
#define USART_ABRF          (1 << 15)
#define USART_ABRE          (1 << 14)
#define USART_EOBF          (1 << 12)
#define USART_RTOF          (1 << 11)
#define USART_CTS           (1 << 10)
#define USART_CTSIF         (1 << 9)
#define USART_LBDF          (1 << 8)
#define USART_TXE           (1 << 7)
#define USART_TC            (1 << 6)
#define USART_RXNE          (1 << 5)
#define USART_IDLE          (1 << 4)
#define USART_ORE           (1 << 3)
#define USART_NF            (1 << 2)
#define USART_FE            (1 << 1)
#define USART_PE            (1 << 0)

// ICR bits
#define USART_WUCF          (1 << 20)
#define USART_CMCF          (1 << 17)
#define USART_EOBCF         (1 << 12)
#define USART_RTOCF         (1 << 11)
#define USART_CTSCF         (1 << 9)
#define USART_LBDCF         (1 << 8)
#define USART_TCCF          (1 << 6)
#define USART_IDLECF        (1 << 4)
#define USART_ORECF         (1 << 3)
#define USART_NCF           (1 << 2)
#define USART_FECF          (1 << 1)
#define USART_PECF          (1 << 0)

/////////////////////////////////////////
// CAN
/////////////////////////////////////////
typedef struct
{
    arm_reg_t IR;
    arm_reg_t DTR;
    arm_reg_t LR;
    arm_reg_t HR;
} CAN_mailbox_t;

typedef struct
{
    arm_reg_t R1;
    arm_reg_t R2;
} CAN_filter_t;

typedef struct
{
    arm_reg_t MCR;
    arm_reg_t MSR;
    arm_reg_t TSR;
    arm_reg_t RFxR[2];
    arm_reg_t IER;
    arm_reg_t ESR;
    arm_reg_t BTR;
    
    arm_reg_t reserved0[88];
    
    CAN_mailbox_t   TMB[3];
    CAN_mailbox_t   RMB[2];
    
    arm_reg_t reserved1[12];
    
    arm_reg_t FMR;
    arm_reg_t FM1R;
    
    arm_reg_t reserved2;
    
    arm_reg_t FS1R;
    
    arm_reg_t reserved3;
    
    arm_reg_t FFA1R;
    
    arm_reg_t reserved4;
    
    arm_reg_t FA1R;
    
    arm_reg_t reserved5;
    
    arm_reg_t reserved6[7];

    CAN_filter_t    FILT[14];
} CAN_t;

#define CAN   ((CAN_t*) STM_BXCAN_BASE)

// MCR bits
#define CAN_DBF             (1 << 16)
#define CAN_RESET           (1 << 15)
#define CAN_TTCM            (1 << 7)
#define CAN_ABOM            (1 << 6)
#define CAN_AWUM            (1 << 5)
#define CAN_NART            (1 << 4)
#define CAN_RFLM            (1 << 3)
#define CAN_TXFP            (1 << 2)
#define CAN_SLEEP           (1 << 1)
#define CAN_INRQ            (1 << 0)

// MSR bits
#define CAN_RX              (1 << 11)
#define CAN_SAMP            (1 << 10)
#define CAN_RXM             (1 << 9)
#define CAN_TXM             (1 << 8)
#define CAN_SLAKI           (1 << 4)
#define CAN_WKUI            (1 << 3)
#define CAN_ERRI            (1 << 2)
#define CAN_SLAK            (1 << 1)
#define CAN_INAK            (1 << 0)

// TSR bits
#define CAN_LOW(n)          (1 << (29 + (n)))
#define CAN_TME(n)          (1 << (26 + (n)))
#define CAN_GET_CODE(r)     (((r) >> 24) & 0x3)
#define CAN_ABRQ(n)         (1 << (7 + 8 * (n)))
#define CAN_TERR(n)         (1 << (3 + 8 * (n)))
#define CAN_ALST(n)         (1 << (2 + 8 * (n)))
#define CAN_TXOK(n)         (1 << (1 + 8 * (n)))
#define CAN_RQCP(n)         (1 << (0 + 8 * (n)))

// RFxR bits
#define CAN_RFOM            (1 << 5)
#define CAN_FOVR            (1 << 4)
#define CAN_FULL            (1 << 3)
#define CAN_GET_FMP(r)      ((r) & 0x3)

// IER bits
#define CAN_SLKIE           (1 << 17)
#define CAN_WKUIE           (1 << 16)
#define CAN_ERRIE           (1 << 15)
#define CAN_LECIE           (1 << 11)
#define CAN_BOFIE           (1 << 10)
#define CAN_EPVIE           (1 << 9)
#define CAN_EWGIE           (1 << 8)
#define CAN_FOVIE(n)        (1 << (3 + 3 * (n)))
#define CAN_FFIE(n)         (1 << (2 + 3 * (n)))
#define CAN_FMPIE(n)        (1 << (1 + 3 * (n)))
#define CAN_TMEIE           (1 << 0)

// ESR bits
#define CAN_GET_REC(r)      (((r) >> 24) & 0xFF)
#define CAN_GET_TEC(r)      (((r) >> 16) & 0xFF)
#define CAN_GET_LEC(r)      (((r) >> 4) & 0x7)
#define CAN_BOFF            (1 << 2)
#define CAN_EPVF            (1 << 1)
#define CAN_EWGF            (1 << 0)
// LEC field codes
#define CAN_LEC_NO_ERROR                0
#define CAN_LEC_STUFF_ERROR             1
#define CAN_LEC_FORM_ERROR              2
#define CAN_LEC_ACKNOWLEDGMENT_ERROR    3
#define CAN_LEC_BIT_RECESSIVE_ERROR     4
#define CAN_LEC_BIT_DOMINANT_ERROR      5
#define CAN_LEC_CRC_ERROR               6
#define CAN_LEC_RESET                   7

// BTR bits
#define CAN_SILM            (1 << 31)
#define CAN_LBKM            (1 << 30)
#define CAN_SJW(x)          ((x) << 24)
#define CAN_TS2(x)          ((x) << 20)
#define CAN_TS1(x)          ((x) << 16)
#define CAN_BRP(x)          ((x) << 0)

// Mailbox IR bits
#define CAN_STID(x)         ((x) << 21)
#define CAN_GET_STID(r)     (((r) >> 21) & 0x7FF)
#define CAN_EXID(x)         ((x) << 3)
#define CAN_GET_EXID(r)     (((r) >> 3) & 0x1FFFFFFF)
#define CAN_IDE             (1 << 2)
#define CAN_RTR             (1 << 1)
#define CAN_TXRQ            (1 << 0)

// Mailbox DTR bits
#define CAN_TIME(x)         ((x) << 16)
#define CAN_GET_TIME(r)     ((r) >> 16)
#define CAN_TGT             (1 << 8)
#define CAN_GET_FMI(r)      (((r) >> 8) & 0xFF)
#define CAN_DLC(x)          (x)
#define CAN_GET_DLC(r)      ((r) & 0xF)

// FMR bits
#define CAN_FINIT           (1 << 0)

// FM1R bits
#define CAN_FBM(n)          (1 << (n))

// FS1R bits
#define CAN_FSC(n)          (1 << (n))

// FFA1R bits
#define CAN_FFA(n)          (1 << (n))

// FA1R bits
#define CAN_FACT(n)         (1 << (n))

/////////////////////////////////////////
// I2C
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR1;
    arm_reg_t CR2;
    arm_reg_t OAR1;
    arm_reg_t OAR2;
    arm_reg_t TIMINGR;
    arm_reg_t TIMEOUTR;
    arm_reg_t ISR;
    arm_reg_t ICR;
    arm_reg_t PECR;
    arm_reg_t RXDR;
    arm_reg_t TXDR;
} I2C_t;

#define I2C1   ((I2C_t*) STM_I2C1_BASE)
#define I2C2   ((I2C_t*) STM_I2C2_BASE)
#define I2C3   ((I2C_t*) STM_I2C3_BASE)

