alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f3.h
// CR1 bits
#define I2C_PECEN           (1 << 23)
#define I2C_ALERTEN         (1 << 22)
#define I2C_SMBDEN          (1 << 21)
#define I2C_SMBHEN          (1 << 20)
#define I2C_GCEN            (1 << 19)
#define I2C_WUPEN           (1 << 18)
#define I2C_NOSTRETCH       (1 << 17)
#define I2C_SBC             (1 << 16)
#define I2C_RXDMAEN         (1 << 15)
#define I2C_TXDMAEN         (1 << 14)
#define I2C_ANFOFF          (1 << 12)
#define I2C_DNF(x)          ((x) << 8)
#define I2C_ERRIE           (1 << 7)
#define I2C_TCIE            (1 << 6)
#define I2C_STOPIE          (1 << 5)
#define I2C_NACKIE          (1 << 4)
#define I2C_ADDRIE          (1 << 3)
#define I2C_RXIE            (1 << 2)
#define I2C_TXIE            (1 << 1)
#define I2C_PE              (1 << 0)

// CR2 bits
#define I2C_PECBYTE         (1 << 26)
#define I2C_AUTOEND         (1 << 25)
#define I2C_RELOAD          (1 << 24)
#define I2C_NBYTES(n)       ((n) << 16)
#define I2C_NACK            (1 << 15)
#define I2C_STOP            (1 << 14)
#define I2C_START           (1 << 13)
#define I2C_HEAD10R         (1 << 12)
#define I2C_ADD10           (1 << 11)
#define I2C_RD_WRN          (1 << 10)
#define I2C_SADD(x)         (x)

// OAR1 bits
#define I2C_OA1EN           (1 << 15)
#define I2C_OA1MODE         (1 << 10)
#define I2C_OA(x)           (x)

// OAR2 bits
#define I2C_OA2EN           (1 << 15)
#define I2C_OA2MSK(x)       ((x) << 10)
#define I2C_OA2             (x)

// TIMINGR bits
#define I2C_PRESC(x)        ((x) << 28)
#define I2C_SCLDEL(x)       ((x) << 20)
#define I2C_SDADEL(x)       ((x) << 16)
#define I2C_SCLH(x)         ((x) << 8)
#define I2C_SCLL(x)         ((x) << 0)

// TIMEOUTR bits
#define I2C_TEXTEN          (1 << 31)
#define I2C_TIMEOUTB(x)     ((x) << 16)
#define I2C_TIMEOUTEN       (1 << 15)
#define I2C_TIDLE           (1 << 12)
#define I2C_TIMEOUTA(x)     ((x) << 0)

// ISR bits
#define I2C_ADDCODE(x)      ((x) << 17)
#define I2C_GET_ADDCODE(r)  (((r) >> 17) & 0x7F)
#define I2C_DIR             (1 << 16)
#define I2C_BUSY            (1 << 15)
#define I2C_ALERT           (1 << 13)
#define I2C_TIMOUT          (1 << 12)
#define I2C_PECERR          (1 << 11)
#define I2C_OVR             (1 << 10)
#define I2C_ARLO            (1 << 9)
#define I2C_BERR            (1 << 8)
#define I2C_TCR             (1 << 7)
#define I2C_TC              (1 << 6)
#define I2C_STOPF           (1 << 5)
#define I2C_NACKF           (1 << 4)
#define I2C_ADDR            (1 << 3)
#define I2C_RXNE            (1 << 2)
#define I2C_TXIS            (1 << 1)
#define I2C_TXE             (1 << 0)

// ICR bits
#define I2C_ALERTCF         (1 << 13)
#define I2C_TIMOUTCF        (1 << 12)
#define I2C_PECCF           (1 << 11)
#define I2C_OVRCF           (1 << 10)
#define I2C_ARLOCF          (1 << 9)
#define I2C_BERRCF          (1 << 8)
#define I2C_STOPCF          (1 << 5)
#define I2C_NACKCF          (1 << 4)
#define I2C_ADDRCF          (1 << 3)

/////////////////////////////////////////
// DMA
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CCR;      // Configuration
    arm_reg_t CNDTR;    // Number of data
    arm_reg_t CPAR;     // Peripheral address
    arm_reg_t CMAR;     // Memory address
    arm_reg_t reserved;
} DMA_CHANNEL_t;

typedef struct
{
    arm_reg_t       ISR;        // Interrupt Status
    arm_reg_t       IFCR;       // Interrupt Flag Clear
    DMA_CHANNEL_t   chan[7];    // DMA channels registers
} DMA_t;

#define DMA1    ((DMA_t*) STM_DMA1_BASE)
#define DMA2    ((DMA_t*) STM_DMA2_BASE)

#define DMA1_CH(x)  ((DMA_CHANNEL_t *) &(DMA1->chan[(x)-1]))
#define DMA2_CH(x)  ((DMA_CHANNEL_t *) &(DMA2->chan[(x)-1]))

// ISR values
#define DMA_TEIF(x)         (8 << (((x) - 1) * 4))
#define DMA_HTIF(x)         (4 << (((x) - 1) * 4))
#define DMA_TCIF(x)         (2 << (((x) - 1) * 4))
#define DMA_GIF(x)          (1 << (((x) - 1) * 4))

// IFCR values
#define DMA_CTEIF(x)        (8 << (((x) - 1) * 4))
#define DMA_CHTIF(x)        (4 << (((x) - 1) * 4))
#define DMA_CTCIF(x)        (2 << (((x) - 1) * 4))
#define DMA_CGIF(x)         (1 << (((x) - 1) * 4))

// CCR values
#define DMA_MEM2MEM         (1 << 14)
#define DMA_PL(x)           ((x) << 12)
#define DMA_MSIZE_8         (0 << 10)
#define DMA_MSIZE_16        (1 << 10)
#define DMA_MSIZE_32        (2 << 10)
#define DMA_PSIZE_8         (0 << 8)
#define DMA_PSIZE_16        (1 << 8)
#define DMA_PSIZE_32        (2 << 8)
#define DMA_MINC            (1 << 7)
#define DMA_PINC            (1 << 6)
#define DMA_CIRC            (1 << 5)
#define DMA_DIR_FROM_MEM    (1 << 4)
#define DMA_TEIE            (1 << 3)
#define DMA_HTIE            (1 << 2)
#define DMA_TCIE            (1 << 1)
#define DMA_EN              (1 << 0)

